import re
import os
import sys
import time
import numpy as np
from pandas import DataFrame, Series
import pandas as pd
from datetime import datetime
from datetime import timedelta
import pymysql
import json
def analysis():
    path = 'D:\\work\\dian_hua_bang\\2018-4-10\\'
    file = '电话邦测试样本的对比结果_2.xlsx'
    data = pd.read_excel(path+file, '汇总', header=0)
    co_list = data.columns
    resu_1 = data.iloc[:, 83:147]
    resu_1['uid'] = data['uid']
    co_list_1 = resu_1.columns
    resu_2 = data[['uid']]
    name = ['所有时期', '近一周', '近两周', '近三周', '0日30日', '30日60日', '60日90日']
    name_2 = ['号码数量', '通话次数', '通话次数_主叫', '通话次数_被叫']
    resu_2['所有时期'+'_'+'号码数量'+'_'+'差值'] = data['所有时期_号码数量'] - data['所有时期_(催收)通话号码总个数']
    resu_2['所有时期' + '_' + '通话次数' + '_' + '差值'] = data['所有时期_通话次数'] - data['所有时期_(催收)总通话次数']
    resu_2['所有时期' + '_' + '通话次数_主叫' + '_' + '差值'] = data['所有时期_通话次数_主叫'] - data['所有时期_(催收)主叫次数']
    resu_2['所有时期' + '_' + '通话次数_被叫' + '_' + '差值'] = data['所有时期_通话次数_被叫'] - data['所有时期_(催收)被叫次数']

    resu_2['近一周'+'_'+'号码数量'+'_'+'差值'] = data['近一周_号码数量'] - data['(近一周)(催收)通话号码总个数']
    resu_2['近一周' + '_' + '通话次数' + '_' + '差值'] = data['近一周_通话次数'] - data['(近一周)(催收)总通话次数']
    resu_2['近一周' + '_' + '通话次数_主叫' + '_' + '差值'] = data['近一周_通话次数_主叫'] - data['(近一周)(催收)主叫次数']
    resu_2['近一周' + '_' + '通话次数_被叫' + '_' + '差值'] = data['近一周_通话次数_被叫'] - data['(近一周)(催收)被叫次数']

    resu_2['近两周'+'_'+'号码数量'+'_'+'差值'] = data['近两周_号码数量'] - data['(近两周)(催收)通话号码总个数']
    resu_2['近两周' + '_' + '通话次数' + '_' + '差值'] = data['近两周_通话次数'] - data['(近两周)(催收)总通话次数']
    resu_2['近两周' + '_' + '通话次数_主叫' + '_' + '差值'] = data['近两周_通话次数_主叫'] - data['(近两周)(催收)主叫次数']
    resu_2['近两周' + '_' + '通话次数_被叫' + '_' + '差值'] = data['近两周_通话次数_被叫'] - data['(近两周)(催收)被叫次数']

    resu_2['近三周'+'_'+'号码数量'+'_'+'差值'] = data['近三周_号码数量'] - data['(近三周)(催收)通话号码总个数']
    resu_2['近三周' + '_' + '通话次数' + '_' + '差值'] = data['近三周_通话次数'] - data['(近三周)(催收)总通话次数']
    resu_2['近三周' + '_' + '通话次数_主叫' + '_' + '差值'] = data['近三周_通话次数_主叫'] - data['(近三周)(催收)主叫次数']
    resu_2['近三周' + '_' + '通话次数_被叫' + '_' + '差值'] = data['近三周_通话次数_被叫'] - data['(近三周)(催收)被叫次数']

    resu_2['0日30日'+'_'+'号码数量'+'_'+'差值'] = data['0日30日_号码数量'] - data['(近30个自然日)(催收)通话号码总个数']
    resu_2['0日30日' + '_' + '通话次数' + '_' + '差值'] = data['0日30日_通话次数'] - data['(近30个自然日)(催收)总通话次数']
    resu_2['0日30日' + '_' + '通话次数_主叫' + '_' + '差值'] = data['0日30日_通话次数_主叫'] - data['(近30个自然日)(催收)主叫次数']
    resu_2['0日30日' + '_' + '通话次数_被叫' + '_' + '差值'] = data['0日30日_通话次数_被叫'] - data['(近30个自然日)(催收)被叫次数']

    resu_2['30日60日'+'_'+'号码数量'+'_'+'差值'] = data['30日60日_号码数量'] - data['(近30-60个自然日)(催收)通话号码总个数']
    resu_2['30日60日' + '_' + '通话次数' + '_' + '差值'] = data['30日60日_通话次数'] - data['(近30-60个自然日)(催收)总通话次数']
    resu_2['30日60日' + '_' + '通话次数_主叫' + '_' + '差值'] = data['30日60日_通话次数_主叫'] - data['(近30-60个自然日)(催收)主叫次数']
    resu_2['30日60日' + '_' + '通话次数_被叫' + '_' + '差值'] = data['30日60日_通话次数_被叫'] - data['(近30-60个自然日)(催收)被叫次数']

    resu_2['60日90日'+'_'+'号码数量'+'_'+'差值'] = data['60日90日_号码数量'] - data['(近60-90个自然日)(催收)通话号码总个数']
    resu_2['60日90日' + '_' + '通话次数' + '_' + '差值'] = data['60日90日_通话次数'] - data['(近60-90个自然日)(催收)总通话次数']
    resu_2['60日90日' + '_' + '通话次数_主叫' + '_' + '差值'] = data['60日90日_通话次数_主叫'] - data['(近60-90个自然日)(催收)主叫次数']
    resu_2['60日90日' + '_' + '通话次数_被叫' + '_' + '差值'] = data['30日60日_通话次数_被叫'] - data['(近60-90个自然日)(催收)被叫次数']

    in_list = []
    for x in resu_2.columns:
        in_list.extend(list(resu_2[resu_2[x] < 0].index))#有重复值

    resu_3 = resu_2.drop(in_list, axis=0)
    writer = pd.ExcelWriter(path+'电话邦差值.xlsx')
    resu_1.to_excel(writer,sheet_name='通话记录')
    resu_2.to_excel(writer, sheet_name='通话记录_差值(全)')
    resu_3.to_excel(writer, sheet_name='通话记录_差值(除去负值)')
    writer.save()

if __name__ == '__main__':
    analysis()